{"pages":[{"title":"<i class='fab fa-d3 d3fa-color-blue'><\/i> Content Tabs","text":"Weitere Informationen zum Modul Content Tabs finden Sie in unserem Shop: https:\/\/www.oxidmodule.com\/OXID-eShop\/Module\/Content-Tabs-fuer-Oxid-PE.html","tags":"","url":"index.html"},{"title":"Changelog","text":"Changelog All notable changes to this project will be documented in this file. 4.1.0.2 - 2019-02-15 fixed letzter Tab wurde nicht im Frontend gezeigt Artikel-Objekte wurden auch mit inaktivem Modul (ModCfg) erweitert 4.1.0.1 - 2019-02-08 fixed Artikel konnten nicht gespeichert werden: verhindert, dass tabellenfremde Felder in den Save Query integriert werden Speichern veränderte HTML Encoding parallel existierender Tabinhalte Speichern von Tabinhalten (&gt;= Tab 2) löschte Standardlangtext des Artikels Tabinhalte wurden mit verändertem HTML Encoding ans Frontend ausgeliefert 4.1.0.0 - 2019-01-18 added Variantenartikel erben Langtexte der Elternartikel modulspezifisches Thememapping eingefügt Löschfunktion für angelegten Tab eingefügt changed keine Bearbeitung von zwischen Mandanten vererbten Artikelinhalten möglich Admin deaktiviert Eingabefelder, wenn deren Funktion vom Tab vordefiniert ist Admin zeigt Hinweis für Standard-Tabtitel, wenn kein Titel vergeben wurde Tab-Eigenschaften werden in Artikel-Objekt geladen und gespeichert (statt im proprietären eigenen Objekt) Logik aus Template ins Model verschoben (flow + azure) auf HTML-Dokumentation umgestellt 4.0.0.2 - 2018-10-19 added Freigabe für OXID 6.1.x Fehlerhinweise eingefügt, wenn Langtexte nicht ausreichend befüllt sind fixed Schreibschutz für Langtexte an Artikelvarianten entfernt 4.0.0.1 - 2018-03-01 fixed Exception im Admin unter \/Content Tabs\/Tabverwaltung\/Stamm\/ 4.0.0.0 - 2018-03-01 added Kompatibilität und Support ab Oxid 6.0.0 Integration eines eigenen Admin-Bereich &quot; Content Tabs&quot; Langtexte haben eine &quot;Aktiv&quot; - Option erhalten, welche im Frontend zusätzlich geprüft wird Grundinstallation via Composer changed Titel und Langtexte der Tabs werden in einer eigenen Tabelle gespeichert Altlasten und unnötige Dateien entfernt Umstellung auf Namespaces 3.2.0.1 - 2016-12-19 Support für Apache 2.4 Paketbereitstellung für ionCube 3.2.0.0 - 2016-07-22 drop: techn. Support für Shopversionen 4.7.x eingestellt add: Freigabe für 4.10.x add: Prüfung auf gültige Modul-Dateien implementiert add feature: Support für Oxid-Theme Flow 3.1.0.2 - 2015-10-07 bugfix: &quot;Shop offline&quot; Anzeige nach der Wahl einer Variante im Frontend bugfix: gepflegte Tab-Inhalte wurden nicht angezeigt 3.1.0.1 - 2015-09-03 automatische Installation aufgeteilt, Anlegen der Datenbankfelder erfolgt &quot;step by step&quot; Übernahme Moduleigener Templates in copy_this und Verweis zur Überladung siehe FAQ fehlende Übersetzungen im Shopadmin nachgetragen Modulfreigabe für php5.5 und php5.6 Aktualisierung Vorabprüfung und Installationsanleitung 3.1.0.0 - 2014-11-12 support for mobile-themes adjustment of the structure update precheck 3.0.1.0 - 2014-08-08 Module compatible with Shopvesion 4.8.7 Show Message in Backend if Module is not active rename module-tab-Templates adjustment of the structure delete deprecated files in autoupdate fix module entrys in shopconfiguration 3.0.0.3 - 2014-05-05 Update Precheck 3.0.0.2 - 2014-03-18 bugfix for saving longdesc in admin 3.0.0.1 - 2013-02-22 bugfix when module is inactive, tabs will be shown in frontend 3.0.0.0 - 2013-02-19 restructured for 4.7 \/ 5.0 2.4.6.2 - 2013-06-27 add funktionality for Edition EE add Versioncheck in oxarticle-extension till 4.5.x other method for getting Longdescription than in 4.6.x 2.4.6.1 - 2013-03-12 bugfix in update.sql 2.4.6.0 - 2013-02-01 tab content moved to templates, add extendable blocks 2.4.5.0 - 2012-09-05 added 4.6.0 functionality 2.4.4 - 2012-05-31 bug fix: javaScript fallback causes shop-in-tab-problem 2.4.3 - 2011-11-02 added templates for 451 - 454 added javaScript fallback for non js user 2.4.2 - 2011-09-19 bug fix price doesn't save bug fix showed empty tabs 2.4.1 - 2011-08-16 inheritance implemented bug in save function fixed 2.4.0 - 2011-07-19 restructured removed Ajax lib, switched to jQuery removed ox_cmp module renamed fields (from oxlongdescXXX to d3longdescXXX) in database added 4.5.0 templates 2.1 - 2009-11-13 Xajax-Implementierung au neues Intergrationsschema umgestellt langtext- und templatebasierte Versionen zusammengeführt Fallback-Funktion für Nicht-JavaScript-Einsatz Langtexte in einem Admin-Tab zusammengefaßt Langtext mehrsprachig verfügbar 2.0 - 2009-08-26 auf PE4 portiert 1.1 - 2008-09-22 Fallback-Funktion für Nicht-JavaScript-Einsatz (tpl) Attribute und Bewertungen stehen nun ebenfalls zur Verfügung (tpl) 1.0 - 2008-09-12 Grundfunktion zum Modul komplettiert Scriptbasis ist aktuelles Xajax-Integrationsschema","tags":"","url":"changelog\/Changelog.html"},{"title":"Installation \/ Update \/ Deinstallation","text":"Anforderungen Neuinstallation Update Deinstallation Bei Bedarf bieten wir Ihnen auch gern die Installation des Moduls in Ihrem Shop an. Geben Sie uns bitte unter den unter Hilfe und Support genannten Kontaktdaten Bescheid.","tags":"","url":"installation\/index.html"},{"title":"Systemanforderungen","text":"PHP Version 5.6.x bis 7.2.x PHP Decoder installierter ionCube Loader Shopversionen \/ -editionen OXID eShop Community Edition (CE), Professional Edition (PE) oder Enterprise Edition (EE) in Compilation Version 6.0.x 6.1.x Modul-Connector (kostenfrei bei erhältlich) ab Version 5.1.0.0 Installation via Composer mindestens ein freier Cronjob zur automatischen Ausführung der angelegten Aufgaben Beachten Sie, dass die Ihnen vorliegende Modulversion entsprechend für PHP 5.6, PHP 7.0, PHP 7.1 oder PHP 7.2 sowie dem auf Ihrem Server vorhandenen Decoder (ionCube Loader) kompatibel ist. Im Zweifelsfall kontaktieren Sie uns und nennen den für Ihren Shop genutzten Decoder und die PHP-Version. Kontrollieren Sie bitte auch, ob diese Modulversion für die von Ihnen eingesetzte Shopedition (Professional Edition (PE) oder Enterprise Edition (EE)) ausgelegt ist.","tags":"","url":"installation\/Anforderungen\/Systemanforderungen.html"},{"title":"Vorbereitungen","text":"Installieren Sie bitte zuerst unseren Modul-Connector in der erforderlichen Version. Ob dies evtl. schon geschehen ist, können Sie im Adminbereich Ihres Shops prüfen. Existiert der Punkt Module -&gt; Modul-Connector, können Sie die installierte Version unter Bibliotheksverwaltung ablesen. Fehlt dieser Eintrag, installieren Sie den kostenfreien Connector. Informationen zu dessen Installation finden Sie auf unserer Homepage. Klicken Sie auf den Reiter Downloads und wählen dort das für Ihre Installation passende Paket.","tags":"","url":"installation\/Anforderungen\/Vorbereitungen.html"},{"title":"Neuinstallation","text":"Schnellstart per Composer php composer require d3\/contenttabs –-update-no-dev Detailliertere Angaben zur Installation entnehmen Sie bitte den folgenden Seiten.","tags":"","url":"installation\/Neuinstallation\/index.html"},{"title":"Vorbereitungen","text":"Installieren Sie bitte zuerst unseren Modul-Connector in der erforderlichen Version. Ob dies evtl. schon geschehen ist, können Sie im Adminbereich Ihres Shops prüfen. Existiert der Punkt Module -&gt; Modul-Connector, können Sie die installierte Version unter Bibliotheksverwaltung ablesen. Fehlt dieser Eintrag, laden Sie den Connector kostenfrei von unserer Homepage. Klicken Sie auf den Reiter Download und dort auf den Link Download Erstinstallation Modul-Connector.","tags":"","url":"installation\/Neuinstallation\/Vorbereitung.html"},{"title":"Modul zur Installation hinzufügen","text":"Führen Sie in der Konsole im selben Verzeichnis diesen Befehl aus, um das Modul Content Tabs zur Installation hinzuzufügen: php composer require d3\/contenttabs --update-no-dev Benötigt Ihre Installation einen anderen Aufruf von Composer, ändern Sie den Befehl bitte entsprechend ab. Für weitere Optionen dieses Befehls lesen Sie bitte die Dokumentation von Composer.","tags":"","url":"installation\/Neuinstallation\/Modul_hinzufuegen.html"},{"title":"Verwendung eigener Themes","text":"Das Modul ist für die Verwendung mit den folgenden OXID-Themes vorbereitet: Flow Azure Verwenden Sie in Ihrem Shop ein angepasstes Verzeichnis für Ihre Templates (neues Theme oder CustomTheme), kopieren Sie die Templates und \/ oder die CSS-Dateien in die neuen Ordner. Ähnelt Ihr neues Theme technisch einem der OXID-Originale, können Sie dieses darauf umleiten. Childs von originalen OXID- Themes benötigen keine Umleitung. Weitere Informationen zur Umleitung finden Sie in unserer FAQ.","tags":"","url":"installation\/Neuinstallation\/Verwendung_eigener_Themes.html"},{"title":"Providerspezifische Installation","text":"Manche Provider erfordern besondere Einstellungen für installierte Module. Ob Ihr Anbieter spezielle Anforderungen stellt und wie diese aussehen, kontrollieren Sie bitte in unserer FAQ.","tags":"","url":"installation\/Neuinstallation\/Providerspezifische_Installation.html"},{"title":"Modul im Shop aktivieren","text":"Aktivieren Sie das Modul über den Shopadmin unter Erweiterungen -&gt; Module. Klicken Sie nach Auswahl von Content Tabs auf den Button Aktivieren. Enterprise Editon: Achten Sie darauf, dass das Modul in weiteren Shops (Mall) ebenfalls aktiviert werden muss, um dessen Funktion dort auch zu nutzen.","tags":"","url":"installation\/Neuinstallation\/Modul_im_Shop_aktivieren.html"},{"title":"Shopanpassungen installieren","text":"Direkt nach der Modulaktivierung startet der Assistent, der Sie durch die Shopanpassung führt. Darin können Sie verschiedene Optionen der Installation wählen. Den Installationsassistenten finden Sie auch unter den Menüpunkten Admin -&gt; Module -&gt; Modul-Connector -&gt; Modulverwaltung -&gt; Modulinstallation. Bei tiefgreifenden Änderungen an Ihrem Shop (z.B. Hinzufügen weiterer Sprachen oder Mandanten) rufen Sie den Installationsassistenten bitte erneut auf, um dann eventuell notwendige Nacharbeiten für das Modul ausführen zu lassen. Möchten Sie die Änderungen manuell installieren, können Sie sich über diesen Assistenten ebenfalls eine Checkliste erstellen.","tags":"","url":"installation\/Neuinstallation\/Shopanpassungen_installieren.html"},{"title":"TMP-Ordner leeren","text":"Leeren Sie das Verzeichnis tmp über Admin -&gt; Module -&gt; Modul-Connector -&gt; TMP leeren. Markieren Sie komplett leeren und klicken auf TMP leeren. Sofern die Views nicht automatisch aktualisiert werden, führen Sie dies noch durch. Erfordert Ihre Installation eine andere Vorgehensweise zum Leeren des Caches oder zum Aktualisieren der Datenbank-Viewtabellen, führen Sie diese bitte aus.","tags":"","url":"installation\/Neuinstallation\/TMP-Ordner_leeren.html"},{"title":"Lizenzschlüssel eintragen","text":"Das Modul verwendet Lizenzschlüssel, um die Lizenzverwaltung für Sie und auch für uns einfacher zu gestalten. Hierbei haben Sie je nach Modul die Wahl zwischen einer kostenfreien Testlizenz und einer Lizenz für den Einsatz im Livebetrieb. Rufen Sie zum Anfordern des Lizenzschlüssels die Modulverwaltung im Adminbereich unter Module -&gt; Modul-Connector -&gt; Modulverwaltung auf. Klappen Sie den Eintrag des jeweiligen Moduls aus. Sofern erforderlich, können Sie hier den Lizenzassistenten starten, der schnell und einfach ihr Modul aktiviert.","tags":"","url":"installation\/Neuinstallation\/Lizenz_eintragen.html"},{"title":"Updatefähigkeit","text":"Bei individuellen Änderungen von Moduldateien empfehlen wir, jeweils die Überladungsmöglichkeiten des Shops dafür zu verwenden. So brauchen Sie die originalen Moduldateien nicht verändern und erhalten sich so die Updatefähigkeit des Shops und des Moduls. Beachten Sie, dass Moduldateien bei Updateinstallationen überschrieben werden. Weitere Informationen zu den Überladungsmöglichkeiten verschiedener Dateien finden Sie in unserer FAQ.","tags":"","url":"installation\/Neuinstallation\/Updatefaehigkeit.html"},{"title":"Update","text":"versionsabhängige Besonderheiten Bei den Modulversionen 3.0.1.0 sowie 3.1.0.0 hat sich die Struktur der Block- und Template-Dateien innerhalb des Moduls geändert. Des Weiteren wurde der Bereich changed_full im Modul entfernt. Haben Sie Anpassungen an damaligen, moduleigenen Dateien vorgenommen, übernehmen Sie diese bitte in eine eigene Erweiterung. Die Modulstrukturen finden Sie nachfolgend: Version 3.0.0.3 oder niedriger ab Verzeichnis \/modules\/d3\/d3contenttabs\/views\/azure\/tpl\/ A -\/- B page\/details\/inc\/d3_ajax_content_tab_1.tpl C page\/details\/inc\/d3_ajax_content_tab_2.tpl D page\/details\/inc\/d3_ajax_content_tab_3.tpl E page\/details\/inc\/d3_ajax_content_tab_4.tpl F page\/details\/inc\/d3_ajax_content_tab_5.tpl Version 3.0.1.0 ab Verzeichnis \/modules\/d3\/d3contenttabs\/views\/ A blocks\/details_tabs_longdescription.tpl B azure\/tpl\/d3contenttabs_tab1.tpl C azure\/tpl\/d3contenttabs_tab2.tpl D azure\/tpl\/d3contenttabs_tab3.tpl E azure\/tpl\/d3contenttabs_tab4.tpl F azure\/tpl\/d3contenttabs_tab5.tpl bis Version 3.2.0.x ab Verzeichnis \/modules\/d3\/d3contenttabs\/views\/ A azure\/blocks\/details_tabs_longdescription.tpl B tpl\/d3contenttabs_tab1.tpl C tpl\/d3contenttabs_tab2.tpl D tpl\/d3contenttabs_tab3.tpl E tpl\/d3contenttabs_tab4.tpl F tpl\/d3contenttabs_tab5.tpl aktuelle Struktur ab Version 4.0.0.0 ab Verzeichnis \/sources\/modules\/d3\/contenttabs\/Application\/views\/ A blocks\/details_tabs_longdescription.tpl B tpl\/d3contenttabs_tab1.tpl C tpl\/d3contenttabs_tab1.tpl ... ... Alle weiteren Updateschritte entnehmen Sie bitte den weiteren Unterseiten.","tags":"","url":"installation\/Update\/index.html"},{"title":"Modul deaktivieren","text":"Deaktivieren Sie das Modul über den Shopadmin unter Erweiterungen -&gt; Module. Klicken Sie nach Auswahl von Content Tabs auf den Button Deaktivieren.","tags":"","url":"installation\/Update\/Modul_deaktivieren.html"},{"title":"Paketquelle entfernen","text":"Durch einen Wechsel der Paketquelle ist die veraltete Angabe nicht mehr erforderlich. Um Konflikte zu vermeiden, sollte die alte Paketquelle entfernt werden. Haben Sie diese schon früher entfernt, können Sie diesen Schritt überspringen. Starten Sie die Konsole Ihres Webservers und wechseln in das Hauptverzeichnis Ihres Shops (oberhalb des source- und vendor-Verzeichnisses). Senden Sie dort diesen Befehl ab: php composer config --unset repositories.d3 php composer config --unset repositories.D3modules Achten Sie darauf, dass die Installation über Composer mit derselben PHP-Version erfolgt, in der auch Ihr Shop installiert ist. Sie erhalten sonst unpassende Modulpakete. Benötigt Ihre Installation einen anderen Aufruf von Composer, ändern Sie den Befehl bitte entsprechend ab. Für weitere Optionen dieses Befehls lesen Sie bitte die Dokumentation von Composer.","tags":"","url":"installation\/Update\/Paketquelle_entfernen.html"},{"title":"Dateien erneuern","text":"Starten Sie die Konsole Ihres Webservers und wechseln in das Hauptverzeichnis Ihres Shops (oberhalb des source- und vendor-Verzeichnisses). Führen Sie dort diesen Befehl aus: php composer update d3\/contenttabs --no-dev Achten Sie darauf, dass die Installation über Composer mit derselben PHP-Version erfolgt, in der auch Ihr Shop installiert ist. Sie erhalten sonst unpassende Modulpakete. Benötigt Ihre Installation einen anderen Aufruf von Composer, ändern Sie den Befehl bitte entsprechend ab. Für weitere Optionen dieses Befehls lesen Sie bitte die Dokumentation von Composer.","tags":"","url":"installation\/Update\/Dateien_erneuern.html"},{"title":"Providerspezifische Installation","text":"Manche Provider erfordern besondere Einstellungen für installierte Module. Ob Ihr Anbieter spezielle Anforderungen stellt und wie diese aussehen, kontrollieren Sie bitte in unserer FAQ.","tags":"","url":"installation\/Update\/Providerspezifische_Installation.html"},{"title":"Modulinformationen aktualisieren","text":"Wechseln Sie im Adminbereich zu Erweiterungen -&gt; Module. Klicken Sie nach Auswahl von Content Tabs auf den Button Aktivieren.","tags":"","url":"installation\/Update\/Modulinformationen_aktualisieren.html"},{"title":"Shopanpassungen installierren","text":"Ob Shopanpassungen notwendig sind, ist von der Versionsänderung des Moduls abhängig. Möglicherweise sehen Sie nach dem Neuaktivieren des Moduls den Installationsassistent, der Sie durch die Änderungen führt. Folgen Sie dann den einzelnen Schritten. Möchten Sie die Änderungen manuell installieren, können Sie sich über diesen Assistenten ebenfalls eine Checkliste erstellen. Wird der Assistent nicht gezeigt (Sie sehen wieder die Modulübersicht), waren keine Anpassungen am Shop notwendig. Ob erforderliche Updates ausgeführt werden sollen, können Sie jederzeit im Adminbereich unter Module -&gt; Modul-Connector -&gt; Modulverwaltung -&gt; Modulinstallation prüfen.","tags":"","url":"installation\/Update\/Shopanpassungen_installieren.html"},{"title":"TMP-Ordner leeren","text":"Leeren Sie das Verzeichnis tmp über Admin -&gt; Module -&gt; Modul-Connector -&gt; TMP leeren. Markieren Sie komplett leeren und klicken auf TMP leeren. Sofern die Views nicht automatisch aktualisiert werden, führen Sie dies noch durch. Erfordert Ihre Installation eine andere Vorgehensweise zum Leeren des Caches oder zum Aktualisieren der Datenbank-Viewtabellen, führen Sie diese bitte aus.","tags":"","url":"installation\/Update\/TMP-Ordner_leeren.html"},{"title":"Lizenzschlüssel aktualisieren","text":"Wird für die neue Modulversion ein aktualisierter Lizenzschlüssel benötigt, tragen Sie diesen im Adminbereich unter Module -&gt; Modul-Connector -&gt; Modulverwaltung ein. Klappen Sie dazu den Eintrag des jeweiligen Moduls aus und starten den Lizenzassistent.","tags":"","url":"installation\/Update\/Lizenzschluessel_aktualisieren.html"},{"title":"Erweiterungen anpassen","text":"Haben Sie für dieses Modul eigene Erweiterung entwickelt, gleichen Sie dies bitte mit der neuen Fassung des Moduls ab.","tags":"","url":"installation\/Update\/Erweiterungen_anpassen.html"},{"title":"Installationsprüfung","text":"Um die erfolgreiche Installation zu prüfen, können Sie die folgende(n) Checkliste(n) verwenden: Einstellungsunabhängige Prüfungen Backend Modul ist unter Erweiterungen -&gt; Module aktiv geschaltet Modul ist unter Module -&gt; Modul-Connector -&gt; Modulverwaltung aktiv geschaltet Modul zeigt unter Module -&gt; Content Tabs einen eigenen Bereich für Einstellungen Einstellungsabhängige Prüfungen Frontend das Modul zeigt auf der Produktdetailseite eigene Tab-Bezeichnungen an nach Auswahl eines Tabs werden die dazugehörigen Langtexte an gezeigt","tags":"","url":"installation\/Installationspruefung.html"},{"title":"Schnellstart","text":"Das Modul Content Tabs bringt einen umfangreichen Adminbereich mit, in dem Sie die Konfigurationseinstellungen des Moduls setzen können. Über das Menü Module -&gt; Content Tabs -&gt; Tabverwaltung erreichen Sie die Einstellungen für die zusätzlichen Langtexte der Artikel.","tags":"","url":"installation\/Schnellstart.html"},{"title":"Modulerweiterungen deaktivieren und entfernen","text":"Deaktivieren Sie alle vorhandenen Erweiterungen, die auf dem Modul Content Tabs aufbauen und löschen bitte alle Dateien dieser Erweiterungen. Entfernen Sie ebenfalls alle individuellen Templateanpassungen für dieses Modul.","tags":"","url":"installation\/Deinstallation\/Modulerweiterungen_deaktivieren_und_entfernen.html"},{"title":"Modul deaktivieren","text":"Deaktivieren Sie das Modul Content Tabs über den Shopadmin Erweiterungen -&gt; Module. Klicken Sie nach Auswahl von Content Tabs auf den Button Deaktivieren.","tags":"","url":"installation\/Deinstallation\/Modul_deaktivieren.html"},{"title":"Modul aus der Installation entfernen","text":"Starten Sie die Konsole Ihres Webservers und wechseln in das Hauptverzeichnis Ihres Shops (oberhalb des source- und vendor-Verzeichnisses). Führen Sie Sie dort diesen Befehl aus: php composer remove d3\/contenttabs --no-update Achten Sie darauf, dass die Installation über Composer mit derselben PHP-Version erfolgt, in der auch Ihr Shop installiert ist. Sie erhalten sonst unpassende Modulpakete. Benötigt Ihre Installation einen anderen Aufruf von Composer, ändern Sie den Befehl bitte entsprechend ab. Für weitere Optionen dieses Befehls lesen Sie bitte die Dokumentation von Composer.","tags":"","url":"installation\/Deinstallation\/Modul_aus_der_Installation_entfernen.html"},{"title":"Dateien löschen","text":"Löschen Sie den Ordner contenttabs und seine enthaltenen Elemente aus dem Verzeichnis source\/modules\/d3 Ihres Shops. Bestätigen Sie anschließend im Shopadmin unter Erweiterungen -&gt; Module -&gt; Installierte Shop-Module die Nachricht: Es gibt registrierte Erweiterungen im eShop, deren Verzeichnis nicht vorhanden ist. Möchten Sie alle Modulinformationen einschließlich Konfigurationseinstellungen und Blockinformationen für Templates löschen?","tags":"","url":"installation\/Deinstallation\/Dateien_loeschen.html"},{"title":"Datenbank bereinigen","text":"Das Modul legt Informationen in der Datenbank ab. Sofern diese Daten nicht mehr benötigt werden, können diese gelöscht werden. Legen Sie sich vorab bitte unbedingt eine Sicherung an, um die Daten im Zweifelsfall wiederherstellen zu können. Für das Modul Content Tabs sind dies die folgende Tabellen und Felder: die komplette Tabelle d3contenttabs sofern vorhanden: d3contenttabs_setX *) sowie diese Einträge bestehenden Tabellen: in Tabelle d3_cfg_mod: den Eintrag oxmodid = &quot;d3contenttabs&quot; **) *) _setX ist eine Tabellenliste, die mit _set1 beginnen und shopabhängig auch Tabellen mit höheren Nummerierungen enthalten kann (z.B. _set2, _set3, …). Zu einigen dieser Tabellen wurden die Config-Einträge aMultiLangTables (bei Enterprise Edition auch aMultiShopTables) um entsprechende Einträge ergänzt). Bereinigen Sie diese ebenfalls. **) Diesen Eintrag gibt es ggf. für jeden Subshop. Entfernen Sie diesen nur für die Mandanten, in denen das Modul nicht mehr installiert ist.","tags":"","url":"installation\/Deinstallation\/Datenbank_bereinigen.html"},{"title":"TMP-Ordner leeren","text":"Leeren Sie das Verzeichnis tmp über Admin -&gt; Module -&gt; Modul-Connector -&gt; TMP leeren. Markieren Sie komplett leeren und klicken auf TMP leeren. Sofern die Views nicht automatisch aktualisiert werden, führen Sie dies noch durch. Erfordert Ihre Installation eine andere Vorgehensweise zum Leeren des Caches oder zum Aktualisieren der Datenbank-Viewtabellen, führen Sie diese bitte aus.","tags":"","url":"installation\/Deinstallation\/TMP-Ordner_leeren.html"},{"title":"Hilfe und Support","text":"Bei Bedarf bieten wir Ihnen auch gern die Installation des Moduls in Ihrem Shop an. Geben Sie uns bitte unter den unten genannten Kontaktdaten Bescheid. Haben Sie Fragen oder Unklarheiten in Verbindung mit diesem Modul oder dessen Installation, stehen Ihnen Hilfetexte in unserer Modul-FAQ zur Verfügung. Finden Sie darin die benötigten Antworten nicht, kontaktieren Sie uns bitte unter den folgenden Möglichkeiten: per E-Mail: support@shopmodule.com oder über das Kontaktformular auf Oxidmodule.com oder per Telefon: (+49) 37 21 \/ 26 80 90 zu unseren Bürozeiten Geben Sie bitte an, wo und wie wir gegebenenfalls vorhandene Schwierigkeiten nachvollziehen können. Sind Ihre Fragen shopspezifisch, benötigen wir möglicherweise Zugangsdaten zum betreffenden Shop. Wir wünschen Ihnen mit Ihrem Shop und dem Modul viel Erfolg! Ihr -Team.","tags":"","url":"support\/Hilfe-und-Support.html"}]}